# ─── Slicker Base Brewfile ─────────────────────────────────────────────
# Core dependencies for slicker configs.
# User-specific apps go in user/Brewfile

# ─── Taps ────────────────────────────────────────────────────────────

tap "BarutSRB/tap"

# ─── Core Tools ──────────────────────────────────────────────────────

brew "stow"
brew "git"
brew "neovim"
brew "tmux"
brew "tmuxinator"
brew "zellij"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "zoxide"
brew "lazygit"
brew "starship"
brew "antidote"
brew "jq"
brew "media-control"
brew "curl"
brew "wget"

# ─── Terminal ────────────────────────────────────────────────────────

cask "ghostty"
cask "raycast"

# ─── Window Management ───────────────────────────────────────────────

brew "omniwm"
